<a href="https://colab.research.google.com/github/Alxsoa/Alexandre-Soares/blob/main/DataFrames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [33]:
import pandas as pd

In [34]:
#
#######################################################################
# Criando as Colunas
#######################################################################
#

ColunaA = [ 1, 2, 3, 4]
ColunaB = [ 2, 4, 6, 8]
ColunaC = [ 3, 6, 9, 12 ]
ColunaD = [ 4, 8, 12, 16 ]

In [35]:
#
#######################################################################
# Criando o DataFrame
#######################################################################
#
df = pd.DataFrame ( [ColunaA, ColunaB, ColunaC, ColunaD], index=list("abcd"), columns=list("ABCD") )

In [36]:
#
#######################################################################
# Listando o Resultado
#######################################################################
#
df

   A  B   C   D
a  1  2   3   4
b  2  4   6   8
c  3  6   9  12
d  4  8  12  16

In [37]:
#
#######################################################################
# Criando Mais uma Coluna (Similar a uma celula do excell)
#######################################################################
#
df['E'] = df['A'] * df['B']
df

   A  B   C   D   E
a  1  2   3   4   2
b  2  4   6   8   8
c  3  6   9  12  18
d  4  8  12  16  32

In [41]:
#
#######################################################################
# Criando Mais uma Coluna (Com Valores Nulos)
#######################################################################
#
df['F'] = 0
df

   A  B   C   D   E  F
a  1  2   3   4   2  0
b  2  4   6   8   8  0
c  3  6   9  12  18  0
d  4  8  12  16  32  0

In [54]:
#
#######################################################################
# Criando o  de Outra Forma
#######################################################################
#
df = pd.DataFrame ( { 'A': [ 1, 2,  3,  4],
                      'B': [ 2, 4,  6,  8],
                      'C': [ 3, 6,  9, 12],
                      'D': [ 4, 8, 18, 32]}, index=list("abcd")) 
df

   A  B   C   D
a  1  2   3   4
b  2  4   6   8
c  3  6   9  18
d  4  8  12  32